junchenghe01/JCOSEK/portable/bsp/s32k144/startup.c
/**
 * @file    startup.c
 * @brief   Startup code and vector table for NXP S32K144 (Cortex-M4F).
 *
 * @details Defines the interrupt vector table in the .isr_vector section
 *          (NXP convention).  Implements Reset_Handler for system init.
 *
 *          All exception and interrupt handlers are weakly aliased to
 *          DefaultISR.  Override any handler by defining a function with
 *          the matching name in user code.
 *
 *          Used symbols from linker script:
 *            __StackTop      — initial MSP (end of system stack)
 *            __DATA_ROM      — Flash address where .data LMA starts
 *            __data_start__  — SRAM address where .data VMA starts
 *            __data_end__    — end of .data in SRAM
 *            __bss_start__   — start of .bss in SRAM
 *            __bss_end__     — end of .bss in SRAM
 *            __RAM_START     — start of SRAM (for ECC init)
 *            __RAM_END       — end of SRAM (for ECC init)
 */

#include <stdint.h>
#include "S32K144.h"

/* ==========================================================================
 * Linker-defined symbols
 * ========================================================================= */
extern uint32_t __StackTop;
extern uint32_t __data_start__;
extern uint32_t __data_end__;
extern uint32_t __DATA_ROM;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;

#ifdef ECC_RAM_INIT
extern uint32_t __RAM_START;
extern uint32_t __RAM_END;
#endif

/* ==========================================================================
 * Forward declarations (needed before vector table)
 * ========================================================================= */
extern int  main(void);
extern void SystemInit(void);
void Reset_Handler(void);
void DefaultISR(void);

static void init_data_bss(void);

/* ==========================================================================
 * Fault capture variables — inspect these in the debugger to identify the
 * root cause when a fault or unexpected interrupt occurs.
 *
 * Usage in GDB:
 *   (gdb) p/x g_fault_cfsr
 *   (gdb) p/x g_fault_hfsr
 *   (gdb) p/x g_fault_mmfar
 *   (gdb) p/x g_fault_bfar
 *   (gdb) p/x g_default_isr_number
 * ========================================================================= */
static volatile uint32_t g_fault_cfsr;             /* Configurable Fault Status Register   */
static volatile uint32_t g_fault_hfsr;             /* HardFault Status Register            */
static volatile uint32_t g_fault_mmfar;            /* MemManage Fault Address Register     */
static volatile uint32_t g_fault_bfar;             /* BusFault Address Register            */
static volatile uint32_t g_fault_ufsr;             /* UsageFault Status Register (CFSR high)*/
static volatile uint32_t g_default_isr_number;     /* Exception # from ICSR.VECTACTIVE     */

/* SCB register base (Cortex-M4) */
#define SCB_ADDR  ((volatile uint32_t *)0xE000ED00U)
#define ICSR_OFF  (0x04U / 4U)   /* 0xE000ED04 — Interrupt Control and State */
#define CFSR_OFF  (0x28U / 4U)   /* 0xE000ED28 — Configurable Fault Status  */
#define HFSR_OFF  (0x2CU / 4U)   /* 0xE000ED2C — HardFault Status           */
#define MMFAR_OFF (0x34U / 4U)   /* 0xE000ED34 — MemManage Fault Address    */
#define BFAR_OFF  (0x38U / 4U)   /* 0xE000ED38 — BusFault Address           */

/* ==========================================================================
 * Default interrupt handler — captures the active exception number from
 * ICSR.VECTACTIVE so you can tell WHICH interrupt/exception fired.
 * ========================================================================= */
void DefaultISR(void)
{
    /* Read ICSR: bits [8:0] = VECTACTIVE (current exception number).
     * Exception numbers:
     *    3 = HardFault, 4 = MemManage, 5 = BusFault, 6 = UsageFault,
     *   11 = SVCall, 14 = PendSV, 15 = SysTick,
     *   16+ = peripheral IRQ (IRQ number = VECTACTIVE - 16)                */
    g_default_isr_number = SCB_ADDR[ICSR_OFF] & 0x1FFU;

    while (1) { }
}

/* ==========================================================================
 * Dedicated fault handlers — each captures its own status register(s)
 * before entering an infinite loop.  Now you can distinguish a HardFault
 * from a stray peripheral interrupt just by the symbol name in the debugger.
 * ========================================================================= */

/* ---- NMI — rare; keep as DefaultISR alias --------------------------------- */
void NMI_Handler(void)           __attribute__((weak, alias("DefaultISR")));
void DebugMon_Handler(void)      __attribute__((weak, alias("DefaultISR")));

/* ---- HardFault ----------------------------------------------------------- */
__attribute__((weak)) void HardFault_Handler(void)
{
    g_fault_hfsr = SCB_ADDR[HFSR_OFF];
    g_default_isr_number = 3; /* HardFault */
    while (1) { }
}

/* ---- MemManage (MPU fault) ----------------------------------------------- */
__attribute__((weak)) void MemManage_Handler(void)
{
    g_fault_cfsr  = SCB_ADDR[CFSR_OFF];
    g_fault_mmfar = SCB_ADDR[MMFAR_OFF];
    g_default_isr_number = 4; /* MemManage */
    while (1) { }
}

/* ---- BusFault (bus error) ------------------------------------------------ */
__attribute__((weak)) void BusFault_Handler(void)
{
    g_fault_cfsr = SCB_ADDR[CFSR_OFF];
    g_fault_bfar = SCB_ADDR[BFAR_OFF];
    g_default_isr_number = 5; /* BusFault */
    while (1) { }
}

/* ---- UsageFault (undefined instr, etc.) ---------------------------------- */
__attribute__((weak)) void UsageFault_Handler(void)
{
    g_fault_cfsr = SCB_ADDR[CFSR_OFF];
    g_default_isr_number = 6; /* UsageFault */
    while (1) { }
}

/* PendSV and SVC are provided by the OS port layer (portasm.S),
 * but declared weak here so the build succeeds without the kernel. */
void PendSV_Handler(void)        __attribute__((weak, alias("DefaultISR")));
void SVC_Handler(void)           __attribute__((weak, alias("DefaultISR")));
void SysTick_Handler(void)       __attribute__((weak, alias("DefaultISR")));

