junchenghe01/JCOSEK/portable/bsp/s32k144/startup.c
/* ==========================================================================
 * Peripheral IRQ handlers — weak aliases for IRQ 0–122.
 *
 * Naming follows the NXP SDK convention.  Override by defining the same
 * function name in user code.
 * ========================================================================= */
#define IRQ_WEAK(name) \
    void name(void) __attribute__((weak, alias("DefaultISR")))

IRQ_WEAK(DMA0_IRQHandler);
IRQ_WEAK(DMA1_IRQHandler);
IRQ_WEAK(DMA2_IRQHandler);
IRQ_WEAK(DMA3_IRQHandler);
IRQ_WEAK(DMA4_IRQHandler);
IRQ_WEAK(DMA5_IRQHandler);
IRQ_WEAK(DMA6_IRQHandler);
IRQ_WEAK(DMA7_IRQHandler);
IRQ_WEAK(DMA8_IRQHandler);
IRQ_WEAK(DMA9_IRQHandler);
IRQ_WEAK(DMA10_IRQHandler);
IRQ_WEAK(DMA11_IRQHandler);
IRQ_WEAK(DMA12_IRQHandler);
IRQ_WEAK(DMA13_IRQHandler);
IRQ_WEAK(DMA14_IRQHandler);
IRQ_WEAK(DMA15_IRQHandler);
IRQ_WEAK(DMA_Error_IRQHandler);
IRQ_WEAK(MCM_IRQHandler);
IRQ_WEAK(FTFC_IRQHandler);
IRQ_WEAK(Read_Collision_IRQHandler);
IRQ_WEAK(LVD_LVW_IRQHandler);
IRQ_WEAK(FTFC_Fault_IRQHandler);
IRQ_WEAK(WDOG_EWM_IRQHandler);
IRQ_WEAK(RCM_IRQHandler);
IRQ_WEAK(LPI2C0_Master_IRQHandler);
IRQ_WEAK(LPI2C0_Slave_IRQHandler);
IRQ_WEAK(LPSPI0_IRQHandler);
IRQ_WEAK(LPSPI1_IRQHandler);
IRQ_WEAK(LPSPI2_IRQHandler);
IRQ_WEAK(Reserved45_IRQHandler);
IRQ_WEAK(Reserved46_IRQHandler);
IRQ_WEAK(LPUART0_RxTx_IRQHandler);
IRQ_WEAK(Reserved48_IRQHandler);
IRQ_WEAK(LPUART1_RxTx_IRQHandler);
IRQ_WEAK(Reserved50_IRQHandler);
IRQ_WEAK(LPUART2_RxTx_IRQHandler);
IRQ_WEAK(Reserved52_IRQHandler);
IRQ_WEAK(Reserved53_IRQHandler);
IRQ_WEAK(Reserved54_IRQHandler);
IRQ_WEAK(ADC0_IRQHandler);
IRQ_WEAK(ADC1_IRQHandler);
IRQ_WEAK(CMP0_IRQHandler);
IRQ_WEAK(Reserved58_IRQHandler);
IRQ_WEAK(Reserved59_IRQHandler);
IRQ_WEAK(ERM_single_fault_IRQHandler);
IRQ_WEAK(ERM_double_fault_IRQHandler);
IRQ_WEAK(RTC_IRQHandler);
IRQ_WEAK(RTC_Seconds_IRQHandler);
IRQ_WEAK(LPIT0_Ch0_IRQHandler);
IRQ_WEAK(LPIT0_Ch1_IRQHandler);
IRQ_WEAK(LPIT0_Ch2_IRQHandler);
IRQ_WEAK(LPIT0_Ch3_IRQHandler);
IRQ_WEAK(PDB0_IRQHandler);
IRQ_WEAK(Reserved69_IRQHandler);
IRQ_WEAK(Reserved70_IRQHandler);
IRQ_WEAK(Reserved71_IRQHandler);
IRQ_WEAK(Reserved72_IRQHandler);
IRQ_WEAK(SCG_IRQHandler);
IRQ_WEAK(LPTMR0_IRQHandler);
IRQ_WEAK(PORTA_IRQHandler);
IRQ_WEAK(PORTB_IRQHandler);
IRQ_WEAK(PORTC_IRQHandler);
IRQ_WEAK(PORTD_IRQHandler);
IRQ_WEAK(PORTE_IRQHandler);
IRQ_WEAK(SWI_IRQHandler);
IRQ_WEAK(Reserved81_IRQHandler);
IRQ_WEAK(Reserved82_IRQHandler);
IRQ_WEAK(Reserved83_IRQHandler);
IRQ_WEAK(PDB1_IRQHandler);
IRQ_WEAK(FLEXIO_IRQHandler);
IRQ_WEAK(Reserved86_IRQHandler);
IRQ_WEAK(Reserved87_IRQHandler);
IRQ_WEAK(Reserved88_IRQHandler);
IRQ_WEAK(Reserved89_IRQHandler);
IRQ_WEAK(Reserved90_IRQHandler);
IRQ_WEAK(Reserved91_IRQHandler);
IRQ_WEAK(Reserved92_IRQHandler);
IRQ_WEAK(Reserved93_IRQHandler);
IRQ_WEAK(CAN0_ORed_IRQHandler);
IRQ_WEAK(CAN0_Error_IRQHandler);
IRQ_WEAK(CAN0_Wake_Up_IRQHandler);
IRQ_WEAK(CAN0_ORed_0_15_MB_IRQHandler);
IRQ_WEAK(CAN0_ORed_16_31_MB_IRQHandler);
IRQ_WEAK(Reserved99_IRQHandler);
IRQ_WEAK(Reserved100_IRQHandler);
IRQ_WEAK(CAN1_ORed_IRQHandler);
IRQ_WEAK(CAN1_Error_IRQHandler);
IRQ_WEAK(Reserved103_IRQHandler);
IRQ_WEAK(CAN1_ORed_0_15_MB_IRQHandler);
IRQ_WEAK(Reserved105_IRQHandler);
IRQ_WEAK(Reserved106_IRQHandler);
IRQ_WEAK(Reserved107_IRQHandler);
IRQ_WEAK(CAN2_ORed_IRQHandler);
IRQ_WEAK(CAN2_Error_IRQHandler);
IRQ_WEAK(Reserved110_IRQHandler);
IRQ_WEAK(CAN2_ORed_0_15_MB_IRQHandler);
IRQ_WEAK(Reserved112_IRQHandler);
IRQ_WEAK(Reserved113_IRQHandler);
IRQ_WEAK(Reserved114_IRQHandler);
IRQ_WEAK(FTM0_Ch0_Ch1_IRQHandler);
IRQ_WEAK(FTM0_Ch2_Ch3_IRQHandler);
IRQ_WEAK(FTM0_Ch4_Ch5_IRQHandler);
IRQ_WEAK(FTM0_Ch6_Ch7_IRQHandler);
IRQ_WEAK(FTM0_Fault_IRQHandler);
IRQ_WEAK(FTM0_Ovf_Reload_IRQHandler);
IRQ_WEAK(FTM1_Ch0_Ch1_IRQHandler);
IRQ_WEAK(FTM1_Ch2_Ch3_IRQHandler);
IRQ_WEAK(FTM1_Ch4_Ch5_IRQHandler);
IRQ_WEAK(FTM1_Ch6_Ch7_IRQHandler);
IRQ_WEAK(FTM1_Fault_IRQHandler);
IRQ_WEAK(FTM1_Ovf_Reload_IRQHandler);
IRQ_WEAK(FTM2_Ch0_Ch1_IRQHandler);
IRQ_WEAK(FTM2_Ch2_Ch3_IRQHandler);
IRQ_WEAK(FTM2_Ch4_Ch5_IRQHandler);
IRQ_WEAK(FTM2_Ch6_Ch7_IRQHandler);
IRQ_WEAK(FTM2_Fault_IRQHandler);
IRQ_WEAK(FTM2_Ovf_Reload_IRQHandler);
IRQ_WEAK(FTM3_Ch0_Ch1_IRQHandler);
IRQ_WEAK(FTM3_Ch2_Ch3_IRQHandler);
IRQ_WEAK(FTM3_Ch4_Ch5_IRQHandler);
IRQ_WEAK(FTM3_Ch6_Ch7_IRQHandler);
IRQ_WEAK(FTM3_Fault_IRQHandler);
IRQ_WEAK(FTM3_Ovf_Reload_IRQHandler);

#undef IRQ_WEAK

/* ==========================================================================
 * __isr_vector — Cortex-M4 Vector Table
 *
 * Size: 256 × 4 bytes = 1024 bytes, fitting exactly in m_interrupts.
 * Placed in .isr_vector per NXP convention.
 *
 * Format:
 *   [0]      Initial SP (loaded by hardware on reset)
 *   [1]      Reset_Handler
 *   [2–15]   System exceptions (NMI … SysTick)
 *   [16–255] External interrupts (IRQ 0–239)
 * ========================================================================= */
__attribute__((section(".isr_vector"), used, aligned(4)))
const uint32_t __isr_vector[256] =
{
    /* --- Initial Stack Pointer --- */
    (uint32_t)&__StackTop,

    /* --- System Exceptions (indices 1–15) --- */
    (uint32_t)Reset_Handler,            /*  1: Reset                     */
    (uint32_t)NMI_Handler,              /*  2: NMI                       */
    (uint32_t)HardFault_Handler,        /*  3: HardFault                 */
    (uint32_t)MemManage_Handler,        /*  4: MemManage                 */
    (uint32_t)BusFault_Handler,         /*  5: BusFault                  */
    (uint32_t)UsageFault_Handler,       /*  6: UsageFault                */
    0U,                                 /*  7: Reserved                  */
    0U,                                 /*  8: Reserved                  */
    0U,                                 /*  9: Reserved                  */
    0U,                                 /* 10: Reserved                  */
    (uint32_t)SVC_Handler,              /* 11: SVCall                    */
    (uint32_t)DebugMon_Handler,         /* 12: Debug Monitor             */
    0U,                                 /* 13: Reserved                  */
    (uint32_t)PendSV_Handler,           /* 14: PendSV                    */
    (uint32_t)SysTick_Handler,          /* 15: SysTick                   */

