junchenghe01/JCOSEK/portable/bsp/s32k144/startup.c
    /* --- External Interrupts 0–31 (indices 16–47) --- */
    (uint32_t)DMA0_IRQHandler,          /* IRQ  0 */
    (uint32_t)DMA1_IRQHandler,          /* IRQ  1 */
    (uint32_t)DMA2_IRQHandler,          /* IRQ  2 */
    (uint32_t)DMA3_IRQHandler,          /* IRQ  3 */
    (uint32_t)DMA4_IRQHandler,          /* IRQ  4 */
    (uint32_t)DMA5_IRQHandler,          /* IRQ  5 */
    (uint32_t)DMA6_IRQHandler,          /* IRQ  6 */
    (uint32_t)DMA7_IRQHandler,          /* IRQ  7 */
    (uint32_t)DMA8_IRQHandler,          /* IRQ  8 */
    (uint32_t)DMA9_IRQHandler,          /* IRQ  9 */
    (uint32_t)DMA10_IRQHandler,         /* IRQ 10 */
    (uint32_t)DMA11_IRQHandler,         /* IRQ 11 */
    (uint32_t)DMA12_IRQHandler,         /* IRQ 12 */
    (uint32_t)DMA13_IRQHandler,         /* IRQ 13 */
    (uint32_t)DMA14_IRQHandler,         /* IRQ 14 */
    (uint32_t)DMA15_IRQHandler,         /* IRQ 15 */
    (uint32_t)DMA_Error_IRQHandler,     /* IRQ 16 */
    (uint32_t)MCM_IRQHandler,           /* IRQ 17 */
    (uint32_t)FTFC_IRQHandler,          /* IRQ 18 */
    (uint32_t)Read_Collision_IRQHandler,/* IRQ 19 */
    (uint32_t)LVD_LVW_IRQHandler,       /* IRQ 20 */
    (uint32_t)FTFC_Fault_IRQHandler,    /* IRQ 21 */
    (uint32_t)WDOG_EWM_IRQHandler,      /* IRQ 22 */
    (uint32_t)RCM_IRQHandler,           /* IRQ 23 */
    (uint32_t)LPI2C0_Master_IRQHandler, /* IRQ 24 */
    (uint32_t)LPI2C0_Slave_IRQHandler,  /* IRQ 25 */
    (uint32_t)LPSPI0_IRQHandler,        /* IRQ 26 */
    (uint32_t)LPSPI1_IRQHandler,        /* IRQ 27 */
    (uint32_t)LPSPI2_IRQHandler,        /* IRQ 28 */
    (uint32_t)Reserved45_IRQHandler,    /* IRQ 29 */
    (uint32_t)Reserved46_IRQHandler,    /* IRQ 30 */
    (uint32_t)LPUART0_RxTx_IRQHandler,  /* IRQ 31 */

    /* --- External Interrupts 32–63 (indices 48–79) --- */
    (uint32_t)Reserved48_IRQHandler,    /* IRQ 32 */
    (uint32_t)LPUART1_RxTx_IRQHandler,  /* IRQ 33 */
    (uint32_t)Reserved50_IRQHandler,    /* IRQ 34 */
    (uint32_t)LPUART2_RxTx_IRQHandler,  /* IRQ 35 */
    (uint32_t)Reserved52_IRQHandler,    /* IRQ 36 */
    (uint32_t)Reserved53_IRQHandler,    /* IRQ 37 */
    (uint32_t)Reserved54_IRQHandler,    /* IRQ 38 */
    (uint32_t)ADC0_IRQHandler,          /* IRQ 39 */
    (uint32_t)ADC1_IRQHandler,          /* IRQ 40 */
    (uint32_t)CMP0_IRQHandler,          /* IRQ 41 */
    (uint32_t)Reserved58_IRQHandler,    /* IRQ 42 */
    (uint32_t)Reserved59_IRQHandler,    /* IRQ 43 */
    (uint32_t)ERM_single_fault_IRQHandler,/* IRQ 44 */
    (uint32_t)ERM_double_fault_IRQHandler,/* IRQ 45 */
    (uint32_t)RTC_IRQHandler,           /* IRQ 46 */
    (uint32_t)RTC_Seconds_IRQHandler,   /* IRQ 47 */
    (uint32_t)LPIT0_Ch0_IRQHandler,     /* IRQ 48 */
    (uint32_t)LPIT0_Ch1_IRQHandler,     /* IRQ 49 */
    (uint32_t)LPIT0_Ch2_IRQHandler,     /* IRQ 50 */
    (uint32_t)LPIT0_Ch3_IRQHandler,     /* IRQ 51 */
    (uint32_t)PDB0_IRQHandler,          /* IRQ 52 */
    (uint32_t)Reserved69_IRQHandler,    /* IRQ 53 */
    (uint32_t)Reserved70_IRQHandler,    /* IRQ 54 */
    (uint32_t)Reserved71_IRQHandler,    /* IRQ 55 */
    (uint32_t)Reserved72_IRQHandler,    /* IRQ 56 */
    (uint32_t)SCG_IRQHandler,           /* IRQ 57 */
    (uint32_t)LPTMR0_IRQHandler,        /* IRQ 58 */
    (uint32_t)PORTA_IRQHandler,         /* IRQ 59 */
    (uint32_t)PORTB_IRQHandler,         /* IRQ 60 */
    (uint32_t)PORTC_IRQHandler,         /* IRQ 61 */
    (uint32_t)PORTD_IRQHandler,         /* IRQ 62 */
    (uint32_t)PORTE_IRQHandler,         /* IRQ 63 */

    /* --- External Interrupts 64–95 (indices 80–111) --- */
    (uint32_t)SWI_IRQHandler,           /* IRQ 64 */
    (uint32_t)Reserved81_IRQHandler,    /* IRQ 65 */
    (uint32_t)Reserved82_IRQHandler,    /* IRQ 66 */
    (uint32_t)Reserved83_IRQHandler,    /* IRQ 67 */
    (uint32_t)PDB1_IRQHandler,          /* IRQ 68 */
    (uint32_t)FLEXIO_IRQHandler,        /* IRQ 69 */
    (uint32_t)Reserved86_IRQHandler,    /* IRQ 70 */
    (uint32_t)Reserved87_IRQHandler,    /* IRQ 71 */
    (uint32_t)Reserved88_IRQHandler,    /* IRQ 72 */
    (uint32_t)Reserved89_IRQHandler,    /* IRQ 73 */
    (uint32_t)Reserved90_IRQHandler,    /* IRQ 74 */
    (uint32_t)Reserved91_IRQHandler,    /* IRQ 75 */
    (uint32_t)Reserved92_IRQHandler,    /* IRQ 76 */
    (uint32_t)Reserved93_IRQHandler,    /* IRQ 77 */
    (uint32_t)CAN0_ORed_IRQHandler,     /* IRQ 78 */
    (uint32_t)CAN0_Error_IRQHandler,    /* IRQ 79 */
    (uint32_t)CAN0_Wake_Up_IRQHandler,  /* IRQ 80 */
    (uint32_t)CAN0_ORed_0_15_MB_IRQHandler,/* IRQ 81 */
    (uint32_t)CAN0_ORed_16_31_MB_IRQHandler,/* IRQ 82 */
    (uint32_t)Reserved99_IRQHandler,    /* IRQ 83 */
    (uint32_t)Reserved100_IRQHandler,   /* IRQ 84 */
    (uint32_t)CAN1_ORed_IRQHandler,     /* IRQ 85 */
    (uint32_t)CAN1_Error_IRQHandler,    /* IRQ 86 */
    (uint32_t)Reserved103_IRQHandler,   /* IRQ 87 */
    (uint32_t)CAN1_ORed_0_15_MB_IRQHandler,/* IRQ 88 */
    (uint32_t)Reserved105_IRQHandler,   /* IRQ 89 */
    (uint32_t)Reserved106_IRQHandler,   /* IRQ 90 */
    (uint32_t)Reserved107_IRQHandler,   /* IRQ 91 */
    (uint32_t)CAN2_ORed_IRQHandler,     /* IRQ 92 */
    (uint32_t)CAN2_Error_IRQHandler,    /* IRQ 93 */
    (uint32_t)Reserved110_IRQHandler,   /* IRQ 94 */
    (uint32_t)CAN2_ORed_0_15_MB_IRQHandler,/* IRQ 95 */

    /* --- External Interrupts 96–122 (indices 112–138) --- */
    (uint32_t)Reserved112_IRQHandler,   /* IRQ 96 */
    (uint32_t)Reserved113_IRQHandler,   /* IRQ 97 */
    (uint32_t)Reserved114_IRQHandler,   /* IRQ 98 */
    (uint32_t)FTM0_Ch0_Ch1_IRQHandler,  /* IRQ 99 */
    (uint32_t)FTM0_Ch2_Ch3_IRQHandler,  /* IRQ 100 */
    (uint32_t)FTM0_Ch4_Ch5_IRQHandler,  /* IRQ 101 */
    (uint32_t)FTM0_Ch6_Ch7_IRQHandler,  /* IRQ 102 */
    (uint32_t)FTM0_Fault_IRQHandler,    /* IRQ 103 */
    (uint32_t)FTM0_Ovf_Reload_IRQHandler,/* IRQ 104 */
    (uint32_t)FTM1_Ch0_Ch1_IRQHandler,  /* IRQ 105 */
    (uint32_t)FTM1_Ch2_Ch3_IRQHandler,  /* IRQ 106 */
    (uint32_t)FTM1_Ch4_Ch5_IRQHandler,  /* IRQ 107 */
    (uint32_t)FTM1_Ch6_Ch7_IRQHandler,  /* IRQ 108 */
    (uint32_t)FTM1_Fault_IRQHandler,    /* IRQ 109 */
    (uint32_t)FTM1_Ovf_Reload_IRQHandler,/* IRQ 110 */
    (uint32_t)FTM2_Ch0_Ch1_IRQHandler,  /* IRQ 111 */
    (uint32_t)FTM2_Ch2_Ch3_IRQHandler,  /* IRQ 112 */
    (uint32_t)FTM2_Ch4_Ch5_IRQHandler,  /* IRQ 113 */
    (uint32_t)FTM2_Ch6_Ch7_IRQHandler,  /* IRQ 114 */
    (uint32_t)FTM2_Fault_IRQHandler,    /* IRQ 115 */
    (uint32_t)FTM2_Ovf_Reload_IRQHandler,/* IRQ 116 */
    (uint32_t)FTM3_Ch0_Ch1_IRQHandler,  /* IRQ 117 */
    (uint32_t)FTM3_Ch2_Ch3_IRQHandler,  /* IRQ 118 */
    (uint32_t)FTM3_Ch4_Ch5_IRQHandler,  /* IRQ 119 */
    (uint32_t)FTM3_Ch6_Ch7_IRQHandler,  /* IRQ 120 */
    (uint32_t)FTM3_Fault_IRQHandler,    /* IRQ 121 */
    (uint32_t)FTM3_Ovf_Reload_IRQHandler,/* IRQ 122 */

    /* --- External Interrupts 123–239 (indices 139–255) ---
     *     All default to DefaultISR.  These cover reserved and unused
     *     interrupt slots on the S32K144.  The ISR name for each is
     *     auto-generated by IRQ_WEAK above and points to DefaultISR.   */
    [139] = (uint32_t)DefaultISR,    [140] = (uint32_t)DefaultISR,
    [141] = (uint32_t)DefaultISR,    [142] = (uint32_t)DefaultISR,
    [143] = (uint32_t)DefaultISR,    [144] = (uint32_t)DefaultISR,
    [145] = (uint32_t)DefaultISR,    [146] = (uint32_t)DefaultISR,
    [147] = (uint32_t)DefaultISR,    [148] = (uint32_t)DefaultISR,
    [149] = (uint32_t)DefaultISR,    [150] = (uint32_t)DefaultISR,
    [151] = (uint32_t)DefaultISR,    [152] = (uint32_t)DefaultISR,
    [153] = (uint32_t)DefaultISR,    [154] = (uint32_t)DefaultISR,
    [155] = (uint32_t)DefaultISR,    [156] = (uint32_t)DefaultISR,
    [157] = (uint32_t)DefaultISR,    [158] = (uint32_t)DefaultISR,
    [159] = (uint32_t)DefaultISR,    [160] = (uint32_t)DefaultISR,
    [161] = (uint32_t)DefaultISR,    [162] = (uint32_t)DefaultISR,
    [163] = (uint32_t)DefaultISR,    [164] = (uint32_t)DefaultISR,
    [165] = (uint32_t)DefaultISR,    [166] = (uint32_t)DefaultISR,
    [167] = (uint32_t)DefaultISR,    [168] = (uint32_t)DefaultISR,
    [169] = (uint32_t)DefaultISR,    [170] = (uint32_t)DefaultISR,
    [171] = (uint32_t)DefaultISR,    [172] = (uint32_t)DefaultISR,
    [173] = (uint32_t)DefaultISR,    [174] = (uint32_t)DefaultISR,
    [175] = (uint32_t)DefaultISR,    [176] = (uint32_t)DefaultISR,
    [177] = (uint32_t)DefaultISR,    [178] = (uint32_t)DefaultISR,
    [179] = (uint32_t)DefaultISR,    [180] = (uint32_t)DefaultISR,
    [181] = (uint32_t)DefaultISR,    [182] = (uint32_t)DefaultISR,
    [183] = (uint32_t)DefaultISR,    [184] = (uint32_t)DefaultISR,
    [185] = (uint32_t)DefaultISR,    [186] = (uint32_t)DefaultISR,
    [187] = (uint32_t)DefaultISR,    [188] = (uint32_t)DefaultISR,
    [189] = (uint32_t)DefaultISR,    [190] = (uint32_t)DefaultISR,
    [191] = (uint32_t)DefaultISR,    [192] = (uint32_t)DefaultISR,
    [193] = (uint32_t)DefaultISR,    [194] = (uint32_t)DefaultISR,
    [195] = (uint32_t)DefaultISR,    [196] = (uint32_t)DefaultISR,
    [197] = (uint32_t)DefaultISR,    [198] = (uint32_t)DefaultISR,
    [199] = (uint32_t)DefaultISR,    [200] = (uint32_t)DefaultISR,
    [201] = (uint32_t)DefaultISR,    [202] = (uint32_t)DefaultISR,
    [203] = (uint32_t)DefaultISR,    [204] = (uint32_t)DefaultISR,
    [205] = (uint32_t)DefaultISR,    [206] = (uint32_t)DefaultISR,
    [207] = (uint32_t)DefaultISR,    [208] = (uint32_t)DefaultISR,
    [209] = (uint32_t)DefaultISR,    [210] = (uint32_t)DefaultISR,
    [211] = (uint32_t)DefaultISR,    [212] = (uint32_t)DefaultISR,
    [213] = (uint32_t)DefaultISR,    [214] = (uint32_t)DefaultISR,
    [215] = (uint32_t)DefaultISR,    [216] = (uint32_t)DefaultISR,
    [217] = (uint32_t)DefaultISR,    [218] = (uint32_t)DefaultISR,
    [219] = (uint32_t)DefaultISR,    [220] = (uint32_t)DefaultISR,
    [221] = (uint32_t)DefaultISR,    [222] = (uint32_t)DefaultISR,
    [223] = (uint32_t)DefaultISR,    [224] = (uint32_t)DefaultISR,
    [225] = (uint32_t)DefaultISR,    [226] = (uint32_t)DefaultISR,
    [227] = (uint32_t)DefaultISR,    [228] = (uint32_t)DefaultISR,
    [229] = (uint32_t)DefaultISR,    [230] = (uint32_t)DefaultISR,
    [231] = (uint32_t)DefaultISR,    [232] = (uint32_t)DefaultISR,
    [233] = (uint32_t)DefaultISR,    [234] = (uint32_t)DefaultISR,
    [235] = (uint32_t)DefaultISR,    [236] = (uint32_t)DefaultISR,
    [237] = (uint32_t)DefaultISR,    [238] = (uint32_t)DefaultISR,
    [239] = (uint32_t)DefaultISR,    [240] = (uint32_t)DefaultISR,
    [241] = (uint32_t)DefaultISR,    [242] = (uint32_t)DefaultISR,
    [243] = (uint32_t)DefaultISR,    [244] = (uint32_t)DefaultISR,
    [245] = (uint32_t)DefaultISR,    [246] = (uint32_t)DefaultISR,
    [247] = (uint32_t)DefaultISR,    [248] = (uint32_t)DefaultISR,
    [249] = (uint32_t)DefaultISR,    [250] = (uint32_t)DefaultISR,
    [251] = (uint32_t)DefaultISR,    [252] = (uint32_t)DefaultISR,
    [253] = (uint32_t)DefaultISR,    [254] = (uint32_t)DefaultISR,
    [255] = (uint32_t)DefaultISR,     /* IRQ 239 */
};

