junchenghe01/JCOSEK/portable/bsp/s32k144/startup.c
/* ==========================================================================
 * Reset_Handler — C entry point after hardware reset.
 *
 * The Cortex-M4 hardware automatically:
 *   1. Reads __StackTop from address 0x00000000 → MSP
 *   2. Reads Reset_Handler from address 0x00000004 → PC
 *   3. Starts executing in Thread mode with MSP
 *
 * This handler completes system initialization and calls main().
 * ========================================================================= */
__attribute__((noreturn)) void Reset_Handler(void)
{
    /* 1. Mask interrupts during critical init */
    __asm__ volatile("cpsid i" : : : "memory");

#if defined(START_FROM_FLASH) && defined(ECC_RAM_INIT)
    /* 2. Initialize ECC SRAM by writing zeros */
    {
        volatile uint32_t *p = &__RAM_START;
        volatile uint32_t *e = &__RAM_END;
        while (p < e) { *p++ = 0U; }
    }
#endif

    /* 3. Reload MSP (hardware already did this, but be safe) */
    __asm__ volatile(
        "ldr r0, =__StackTop \n"
        "msr msp, r0         \n" : : : "r0");

    /* 4. SoC-level init: enable FPU, disable watchdog */
    SystemInit();

    /* 5. Copy .data from Flash to SRAM and zero .bss */
    init_data_bss();

    /* 6. Unmask interrupts */
    __asm__ volatile("cpsie i" : : : "memory");

    /* 7. Jump to application */
    main();

    /* Not reached */
    while (1) { }
}

/* ==========================================================================
 * Flash Configuration Field (FCF)
 *
 * Placed at address 0x400 in Flash.  The S32K144 reads this on reset
 * to determine flash security and protection settings.
 *
 *   Bytes 0-7:  Backdoor Comparison Key (all 0xFF = disabled)
 *   Bytes 8-11: Flash Protection (FDPROT:FEPROT:FOPT:FSEC)
 *               0xFFFF7FFE = unprotected, unsecured (FSEC=0xFE)
 * ========================================================================= */
__attribute__((section(".FlashConfig"), used, aligned(4)))
const uint32_t __flash_config[4] = {
    0xFFFFFFFFU,  /* Backdoor Key [31:0]  */
    0xFFFFFFFFU,  /* Backdoor Key [63:32] */
    0xFFFFFFFFU,  /* FDPROT:FEPROT:FOPT:FSEC (flash protection) */
    0xFFFF7FFEU,  /* FSEC=0xFE → unsecured */
};

/* ==========================================================================
 * init_data_bss — Initialize memory sections.
 * ========================================================================= */
static void init_data_bss(void)
{
    uint32_t *src;
    uint32_t *dst;
    uint32_t *end;

    /* Copy .data from Flash LMA to SRAM VMA */
    src = &__DATA_ROM;
    dst = &__data_start__;
    end = &__data_end__;
    while (dst < end) { *dst++ = *src++; }

    /* Zero .bss */
    dst = &__bss_start__;
    end = &__bss_end__;
    while (dst < end) { *dst++ = 0U; }
}

/* ==========================================================================
 * SystemInit — Weak SoC initialization.
 *
 * Override by linking with the NXP SDK's system_S32K144.c, or customize
 * with compile-time defines:
 *   -DENABLE_FPU=1 / 0   (default: 1)
 *   -DDISABLE_WDOG=1 / 0 (default: 1)
 * ========================================================================= */
#ifndef ENABLE_FPU
#define ENABLE_FPU 1
#endif
#ifndef DISABLE_WDOG
#define DISABLE_WDOG 1
#endif

__attribute__((weak)) void SystemInit(void)
{
#if ENABLE_FPU
    /* Enable CP10 and CP11 for full FPU access */
    SCB->CPACR |= (SCB_CPACR_CP10_MASK | SCB_CPACR_CP11_MASK);
#endif

#if DISABLE_WDOG
    /* Unlock watchdog */
    WDOG->CNT = 0xD928C520U;
    (void)WDOG->CNT;  /* Dummy read to ensure write completes */

    /* Disable watchdog: 32-bit unlock, LPO clock, disabled, allow updates */
    WDOG->CS = (WDOG_CS_CMD32EN(1) |
                WDOG_CS_CLK(2)     |
                WDOG_CS_EN(0)      |
                WDOG_CS_UPDATE(1));

    WDOG->TOVAL = 0xFFFFU;
#endif
}
